MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1554/mcu.h
extern volatile AD1CON0bits_t AD1CON0bits __at(0x711);
// bitfield macros
#define _AD1CON0_ADON_POSN                                  0x0
#define _AD1CON0_ADON_POSITION                              0x0
#define _AD1CON0_ADON_SIZE                                  0x1
#define _AD1CON0_ADON_LENGTH                                0x1
#define _AD1CON0_ADON_MASK                                  0x1
#define _AD1CON0_GO_POSN                                    0x1
#define _AD1CON0_GO_POSITION                                0x1
#define _AD1CON0_GO_SIZE                                    0x1
#define _AD1CON0_GO_LENGTH                                  0x1
#define _AD1CON0_GO_MASK                                    0x2
#define _AD1CON0_CHS_POSN                                   0x2
#define _AD1CON0_CHS_POSITION                               0x2
#define _AD1CON0_CHS_SIZE                                   0x5
#define _AD1CON0_CHS_LENGTH                                 0x5
#define _AD1CON0_CHS_MASK                                   0x7C
#define _AD1CON0_GO_nDONE_POSN                              0x1
#define _AD1CON0_GO_nDONE_POSITION                          0x1
#define _AD1CON0_GO_nDONE_SIZE                              0x1
#define _AD1CON0_GO_nDONE_LENGTH                            0x1
#define _AD1CON0_GO_nDONE_MASK                              0x2
#define _AD1CON0_CHS0_POSN                                  0x2
#define _AD1CON0_CHS0_POSITION                              0x2
#define _AD1CON0_CHS0_SIZE                                  0x1
#define _AD1CON0_CHS0_LENGTH                                0x1
#define _AD1CON0_CHS0_MASK                                  0x4
#define _AD1CON0_CHS1_POSN                                  0x3
#define _AD1CON0_CHS1_POSITION                              0x3
#define _AD1CON0_CHS1_SIZE                                  0x1
#define _AD1CON0_CHS1_LENGTH                                0x1
#define _AD1CON0_CHS1_MASK                                  0x8
#define _AD1CON0_CHS2_POSN                                  0x4
#define _AD1CON0_CHS2_POSITION                              0x4
#define _AD1CON0_CHS2_SIZE                                  0x1
#define _AD1CON0_CHS2_LENGTH                                0x1
#define _AD1CON0_CHS2_MASK                                  0x10
#define _AD1CON0_CHS3_POSN                                  0x5
#define _AD1CON0_CHS3_POSITION                              0x5
#define _AD1CON0_CHS3_SIZE                                  0x1
#define _AD1CON0_CHS3_LENGTH                                0x1
#define _AD1CON0_CHS3_MASK                                  0x20
#define _AD1CON0_CHS4_POSN                                  0x6
#define _AD1CON0_CHS4_POSITION                              0x6
#define _AD1CON0_CHS4_SIZE                                  0x1
#define _AD1CON0_CHS4_LENGTH                                0x1
#define _AD1CON0_CHS4_MASK                                  0x40
#define _AD1CON0_GO_nDONE1_POSN                             0x1
#define _AD1CON0_GO_nDONE1_POSITION                         0x1
#define _AD1CON0_GO_nDONE1_SIZE                             0x1
#define _AD1CON0_GO_nDONE1_LENGTH                           0x1
#define _AD1CON0_GO_nDONE1_MASK                             0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO                     :1;
        unsigned CHS                    :5;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE               :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE1              :1;
    };
} AADCON0bits_t;
extern volatile AADCON0bits_t AADCON0bits __at(0x711);
// bitfield macros
#define _AADCON0_ADON_POSN                                  0x0
#define _AADCON0_ADON_POSITION                              0x0
#define _AADCON0_ADON_SIZE                                  0x1
#define _AADCON0_ADON_LENGTH                                0x1
#define _AADCON0_ADON_MASK                                  0x1
#define _AADCON0_GO_POSN                                    0x1
#define _AADCON0_GO_POSITION                                0x1
#define _AADCON0_GO_SIZE                                    0x1
#define _AADCON0_GO_LENGTH                                  0x1
#define _AADCON0_GO_MASK                                    0x2
#define _AADCON0_CHS_POSN                                   0x2
#define _AADCON0_CHS_POSITION                               0x2
#define _AADCON0_CHS_SIZE                                   0x5
#define _AADCON0_CHS_LENGTH                                 0x5
#define _AADCON0_CHS_MASK                                   0x7C
#define _AADCON0_GO_nDONE_POSN                              0x1
#define _AADCON0_GO_nDONE_POSITION                          0x1
#define _AADCON0_GO_nDONE_SIZE                              0x1
#define _AADCON0_GO_nDONE_LENGTH                            0x1
#define _AADCON0_GO_nDONE_MASK                              0x2
#define _AADCON0_CHS0_POSN                                  0x2
#define _AADCON0_CHS0_POSITION                              0x2
#define _AADCON0_CHS0_SIZE                                  0x1
#define _AADCON0_CHS0_LENGTH                                0x1
#define _AADCON0_CHS0_MASK                                  0x4
#define _AADCON0_CHS1_POSN                                  0x3
#define _AADCON0_CHS1_POSITION                              0x3
#define _AADCON0_CHS1_SIZE                                  0x1
#define _AADCON0_CHS1_LENGTH                                0x1
#define _AADCON0_CHS1_MASK                                  0x8
#define _AADCON0_CHS2_POSN                                  0x4
#define _AADCON0_CHS2_POSITION                              0x4
#define _AADCON0_CHS2_SIZE                                  0x1
#define _AADCON0_CHS2_LENGTH                                0x1
#define _AADCON0_CHS2_MASK                                  0x10
#define _AADCON0_CHS3_POSN                                  0x5
#define _AADCON0_CHS3_POSITION                              0x5
#define _AADCON0_CHS3_SIZE                                  0x1
#define _AADCON0_CHS3_LENGTH                                0x1
#define _AADCON0_CHS3_MASK                                  0x20
#define _AADCON0_CHS4_POSN                                  0x6
#define _AADCON0_CHS4_POSITION                              0x6
#define _AADCON0_CHS4_SIZE                                  0x1
#define _AADCON0_CHS4_LENGTH                                0x1
#define _AADCON0_CHS4_MASK                                  0x40
#define _AADCON0_GO_nDONE1_POSN                             0x1
#define _AADCON0_GO_nDONE1_POSITION                         0x1
#define _AADCON0_GO_nDONE1_SIZE                             0x1
#define _AADCON0_GO_nDONE1_LENGTH                           0x1
#define _AADCON0_GO_nDONE1_MASK                             0x2
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO                     :1;
        unsigned CHS                    :5;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE               :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE1              :1;
    };
} AAD1CON0bits_t;
extern volatile AAD1CON0bits_t AAD1CON0bits __at(0x711);
// bitfield macros
#define _AAD1CON0_ADON_POSN                                 0x0
#define _AAD1CON0_ADON_POSITION                             0x0
#define _AAD1CON0_ADON_SIZE                                 0x1
#define _AAD1CON0_ADON_LENGTH                               0x1
#define _AAD1CON0_ADON_MASK                                 0x1
#define _AAD1CON0_GO_POSN                                   0x1
#define _AAD1CON0_GO_POSITION                               0x1
#define _AAD1CON0_GO_SIZE                                   0x1
#define _AAD1CON0_GO_LENGTH                                 0x1
#define _AAD1CON0_GO_MASK                                   0x2
#define _AAD1CON0_CHS_POSN                                  0x2
#define _AAD1CON0_CHS_POSITION                              0x2
#define _AAD1CON0_CHS_SIZE                                  0x5
#define _AAD1CON0_CHS_LENGTH                                0x5
#define _AAD1CON0_CHS_MASK                                  0x7C
#define _AAD1CON0_GO_nDONE_POSN                             0x1
#define _AAD1CON0_GO_nDONE_POSITION                         0x1
#define _AAD1CON0_GO_nDONE_SIZE                             0x1
#define _AAD1CON0_GO_nDONE_LENGTH                           0x1
#define _AAD1CON0_GO_nDONE_MASK                             0x2
#define _AAD1CON0_CHS0_POSN                                 0x2
#define _AAD1CON0_CHS0_POSITION                             0x2
#define _AAD1CON0_CHS0_SIZE                                 0x1
#define _AAD1CON0_CHS0_LENGTH                               0x1
#define _AAD1CON0_CHS0_MASK                                 0x4
#define _AAD1CON0_CHS1_POSN                                 0x3
#define _AAD1CON0_CHS1_POSITION                             0x3
#define _AAD1CON0_CHS1_SIZE                                 0x1
#define _AAD1CON0_CHS1_LENGTH                               0x1
#define _AAD1CON0_CHS1_MASK                                 0x8
#define _AAD1CON0_CHS2_POSN                                 0x4
#define _AAD1CON0_CHS2_POSITION                             0x4
#define _AAD1CON0_CHS2_SIZE                                 0x1
#define _AAD1CON0_CHS2_LENGTH                               0x1
#define _AAD1CON0_CHS2_MASK                                 0x10
#define _AAD1CON0_CHS3_POSN                                 0x5
#define _AAD1CON0_CHS3_POSITION                             0x5
#define _AAD1CON0_CHS3_SIZE                                 0x1
#define _AAD1CON0_CHS3_LENGTH                               0x1
#define _AAD1CON0_CHS3_MASK                                 0x20
#define _AAD1CON0_CHS4_POSN                                 0x6
#define _AAD1CON0_CHS4_POSITION                             0x6
#define _AAD1CON0_CHS4_SIZE                                 0x1
#define _AAD1CON0_CHS4_LENGTH                               0x1
#define _AAD1CON0_CHS4_MASK                                 0x40
#define _AAD1CON0_GO_nDONE1_POSN                            0x1
#define _AAD1CON0_GO_nDONE1_POSITION                        0x1
#define _AAD1CON0_GO_nDONE1_SIZE                            0x1
#define _AAD1CON0_GO_nDONE1_LENGTH                          0x1
#define _AAD1CON0_GO_nDONE1_MASK                            0x2

// Register: ADCOMCON
#define ADCOMCON ADCOMCON
extern volatile unsigned char           ADCOMCON            __at(0x712);
#ifndef _LIB_BUILD
asm("ADCOMCON equ 0712h");
#endif
// aliases
extern volatile unsigned char           AADCON1             __at(0x712);
#ifndef _LIB_BUILD
asm("AADCON1 equ 0712h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPREF                 :2;
        unsigned GO_nDONE_ALL           :1;
        unsigned                        :1;
        unsigned ADCS                   :3;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADPREF0                :1;
        unsigned ADPREF1                :1;
        unsigned GO_ALL                 :1;
        unsigned                        :1;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
    };
} ADCOMCONbits_t;
extern volatile ADCOMCONbits_t ADCOMCONbits __at(0x712);
// bitfield macros
#define _ADCOMCON_ADPREF_POSN                               0x0
#define _ADCOMCON_ADPREF_POSITION                           0x0
#define _ADCOMCON_ADPREF_SIZE                               0x2
#define _ADCOMCON_ADPREF_LENGTH                             0x2
#define _ADCOMCON_ADPREF_MASK                               0x3
#define _ADCOMCON_GO_nDONE_ALL_POSN                         0x2
#define _ADCOMCON_GO_nDONE_ALL_POSITION                     0x2
#define _ADCOMCON_GO_nDONE_ALL_SIZE                         0x1
#define _ADCOMCON_GO_nDONE_ALL_LENGTH                       0x1
#define _ADCOMCON_GO_nDONE_ALL_MASK                         0x4
#define _ADCOMCON_ADCS_POSN                                 0x4
#define _ADCOMCON_ADCS_POSITION                             0x4
#define _ADCOMCON_ADCS_SIZE                                 0x3
#define _ADCOMCON_ADCS_LENGTH                               0x3
#define _ADCOMCON_ADCS_MASK                                 0x70
#define _ADCOMCON_ADFM_POSN                                 0x7
#define _ADCOMCON_ADFM_POSITION                             0x7
#define _ADCOMCON_ADFM_SIZE                                 0x1
#define _ADCOMCON_ADFM_LENGTH                               0x1
#define _ADCOMCON_ADFM_MASK                                 0x80
#define _ADCOMCON_ADPREF0_POSN                              0x0
#define _ADCOMCON_ADPREF0_POSITION                          0x0
#define _ADCOMCON_ADPREF0_SIZE                              0x1
#define _ADCOMCON_ADPREF0_LENGTH                            0x1
#define _ADCOMCON_ADPREF0_MASK                              0x1
#define _ADCOMCON_ADPREF1_POSN                              0x1
#define _ADCOMCON_ADPREF1_POSITION                          0x1
#define _ADCOMCON_ADPREF1_SIZE                              0x1
#define _ADCOMCON_ADPREF1_LENGTH                            0x1
#define _ADCOMCON_ADPREF1_MASK                              0x2
#define _ADCOMCON_GO_ALL_POSN                               0x2
#define _ADCOMCON_GO_ALL_POSITION                           0x2
#define _ADCOMCON_GO_ALL_SIZE                               0x1
#define _ADCOMCON_GO_ALL_LENGTH                             0x1
#define _ADCOMCON_GO_ALL_MASK                               0x4
#define _ADCOMCON_ADCS0_POSN                                0x4
#define _ADCOMCON_ADCS0_POSITION                            0x4
#define _ADCOMCON_ADCS0_SIZE                                0x1
#define _ADCOMCON_ADCS0_LENGTH                              0x1
#define _ADCOMCON_ADCS0_MASK                                0x10
#define _ADCOMCON_ADCS1_POSN                                0x5
#define _ADCOMCON_ADCS1_POSITION                            0x5
#define _ADCOMCON_ADCS1_SIZE                                0x1
#define _ADCOMCON_ADCS1_LENGTH                              0x1
#define _ADCOMCON_ADCS1_MASK                                0x20
#define _ADCOMCON_ADCS2_POSN                                0x6
#define _ADCOMCON_ADCS2_POSITION                            0x6
#define _ADCOMCON_ADCS2_SIZE                                0x1
#define _ADCOMCON_ADCS2_LENGTH                              0x1
#define _ADCOMCON_ADCS2_MASK                                0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADPREF                 :2;
        unsigned GO_nDONE_ALL           :1;
        unsigned                        :1;
        unsigned ADCS                   :3;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADPREF0                :1;
        unsigned ADPREF1                :1;
        unsigned GO_ALL                 :1;
        unsigned                        :1;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
    };
} AADCON1bits_t;
extern volatile AADCON1bits_t AADCON1bits __at(0x712);
// bitfield macros
#define _AADCON1_ADPREF_POSN                                0x0
#define _AADCON1_ADPREF_POSITION                            0x0
#define _AADCON1_ADPREF_SIZE                                0x2
#define _AADCON1_ADPREF_LENGTH                              0x2
#define _AADCON1_ADPREF_MASK                                0x3
#define _AADCON1_GO_nDONE_ALL_POSN                          0x2
#define _AADCON1_GO_nDONE_ALL_POSITION                      0x2
#define _AADCON1_GO_nDONE_ALL_SIZE                          0x1
#define _AADCON1_GO_nDONE_ALL_LENGTH                        0x1
#define _AADCON1_GO_nDONE_ALL_MASK                          0x4
#define _AADCON1_ADCS_POSN                                  0x4
#define _AADCON1_ADCS_POSITION                              0x4
#define _AADCON1_ADCS_SIZE                                  0x3
#define _AADCON1_ADCS_LENGTH                                0x3
#define _AADCON1_ADCS_MASK                                  0x70
#define _AADCON1_ADFM_POSN                                  0x7
#define _AADCON1_ADFM_POSITION                              0x7
#define _AADCON1_ADFM_SIZE                                  0x1
#define _AADCON1_ADFM_LENGTH                                0x1
#define _AADCON1_ADFM_MASK                                  0x80
#define _AADCON1_ADPREF0_POSN                               0x0
#define _AADCON1_ADPREF0_POSITION                           0x0
#define _AADCON1_ADPREF0_SIZE                               0x1
#define _AADCON1_ADPREF0_LENGTH                             0x1
#define _AADCON1_ADPREF0_MASK                               0x1
#define _AADCON1_ADPREF1_POSN                               0x1
#define _AADCON1_ADPREF1_POSITION                           0x1
#define _AADCON1_ADPREF1_SIZE                               0x1
#define _AADCON1_ADPREF1_LENGTH                             0x1
#define _AADCON1_ADPREF1_MASK                               0x2
#define _AADCON1_GO_ALL_POSN                                0x2
#define _AADCON1_GO_ALL_POSITION                            0x2
#define _AADCON1_GO_ALL_SIZE                                0x1
#define _AADCON1_GO_ALL_LENGTH                              0x1
#define _AADCON1_GO_ALL_MASK                                0x4
#define _AADCON1_ADCS0_POSN                                 0x4
#define _AADCON1_ADCS0_POSITION                             0x4
#define _AADCON1_ADCS0_SIZE                                 0x1
#define _AADCON1_ADCS0_LENGTH                               0x1
#define _AADCON1_ADCS0_MASK                                 0x10
#define _AADCON1_ADCS1_POSN                                 0x5
#define _AADCON1_ADCS1_POSITION                             0x5
#define _AADCON1_ADCS1_SIZE                                 0x1
#define _AADCON1_ADCS1_LENGTH                               0x1
#define _AADCON1_ADCS1_MASK                                 0x20
#define _AADCON1_ADCS2_POSN                                 0x6
#define _AADCON1_ADCS2_POSITION                             0x6
#define _AADCON1_ADCS2_SIZE                                 0x1
#define _AADCON1_ADCS2_LENGTH                               0x1
#define _AADCON1_ADCS2_MASK                                 0x40

// Register: AD1CON2
#define AD1CON2 AD1CON2
extern volatile unsigned char           AD1CON2             __at(0x713);
#ifndef _LIB_BUILD
asm("AD1CON2 equ 0713h");
#endif
// aliases
extern volatile unsigned char           AADCON2             __at(0x713);
#ifndef _LIB_BUILD
asm("AADCON2 equ 0713h");
#endif
extern volatile unsigned char           AAD1CON2            __at(0x713);
#ifndef _LIB_BUILD
asm("AAD1CON2 equ 0713h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AD1CON2bits_t;
