MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1554/mcu.h
extern volatile AD1GRDbits_t AD1GRDbits __at(0x718);
// bitfield macros
#define _AD1GRD_GRD1POL_POSN                                0x5
#define _AD1GRD_GRD1POL_POSITION                            0x5
#define _AD1GRD_GRD1POL_SIZE                                0x1
#define _AD1GRD_GRD1POL_LENGTH                              0x1
#define _AD1GRD_GRD1POL_MASK                                0x20
#define _AD1GRD_GRD1AOE_POSN                                0x6
#define _AD1GRD_GRD1AOE_POSITION                            0x6
#define _AD1GRD_GRD1AOE_SIZE                                0x1
#define _AD1GRD_GRD1AOE_LENGTH                              0x1
#define _AD1GRD_GRD1AOE_MASK                                0x40
#define _AD1GRD_GRD1BOE_POSN                                0x7
#define _AD1GRD_GRD1BOE_POSITION                            0x7
#define _AD1GRD_GRD1BOE_SIZE                                0x1
#define _AD1GRD_GRD1BOE_LENGTH                              0x1
#define _AD1GRD_GRD1BOE_MASK                                0x80
#define _AD1GRD_GRDPOL_POSN                                 0x5
#define _AD1GRD_GRDPOL_POSITION                             0x5
#define _AD1GRD_GRDPOL_SIZE                                 0x1
#define _AD1GRD_GRDPOL_LENGTH                               0x1
#define _AD1GRD_GRDPOL_MASK                                 0x20
#define _AD1GRD_GRDAOE_POSN                                 0x6
#define _AD1GRD_GRDAOE_POSITION                             0x6
#define _AD1GRD_GRDAOE_SIZE                                 0x1
#define _AD1GRD_GRDAOE_LENGTH                               0x1
#define _AD1GRD_GRDAOE_MASK                                 0x40
#define _AD1GRD_GRDBOE_POSN                                 0x7
#define _AD1GRD_GRDBOE_POSITION                             0x7
#define _AD1GRD_GRDBOE_SIZE                                 0x1
#define _AD1GRD_GRDBOE_LENGTH                               0x1
#define _AD1GRD_GRDBOE_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned GRD1POL                :1;
        unsigned GRD1AOE                :1;
        unsigned GRD1BOE                :1;
    };
    struct {
        unsigned                        :5;
        unsigned GRDPOL                 :1;
        unsigned GRDAOE                 :1;
        unsigned GRDBOE                 :1;
    };
} AADGRDbits_t;
extern volatile AADGRDbits_t AADGRDbits __at(0x718);
// bitfield macros
#define _AADGRD_GRD1POL_POSN                                0x5
#define _AADGRD_GRD1POL_POSITION                            0x5
#define _AADGRD_GRD1POL_SIZE                                0x1
#define _AADGRD_GRD1POL_LENGTH                              0x1
#define _AADGRD_GRD1POL_MASK                                0x20
#define _AADGRD_GRD1AOE_POSN                                0x6
#define _AADGRD_GRD1AOE_POSITION                            0x6
#define _AADGRD_GRD1AOE_SIZE                                0x1
#define _AADGRD_GRD1AOE_LENGTH                              0x1
#define _AADGRD_GRD1AOE_MASK                                0x40
#define _AADGRD_GRD1BOE_POSN                                0x7
#define _AADGRD_GRD1BOE_POSITION                            0x7
#define _AADGRD_GRD1BOE_SIZE                                0x1
#define _AADGRD_GRD1BOE_LENGTH                              0x1
#define _AADGRD_GRD1BOE_MASK                                0x80
#define _AADGRD_GRDPOL_POSN                                 0x5
#define _AADGRD_GRDPOL_POSITION                             0x5
#define _AADGRD_GRDPOL_SIZE                                 0x1
#define _AADGRD_GRDPOL_LENGTH                               0x1
#define _AADGRD_GRDPOL_MASK                                 0x20
#define _AADGRD_GRDAOE_POSN                                 0x6
#define _AADGRD_GRDAOE_POSITION                             0x6
#define _AADGRD_GRDAOE_SIZE                                 0x1
#define _AADGRD_GRDAOE_LENGTH                               0x1
#define _AADGRD_GRDAOE_MASK                                 0x40
#define _AADGRD_GRDBOE_POSN                                 0x7
#define _AADGRD_GRDBOE_POSITION                             0x7
#define _AADGRD_GRDBOE_SIZE                                 0x1
#define _AADGRD_GRDBOE_LENGTH                               0x1
#define _AADGRD_GRDBOE_MASK                                 0x80
typedef union {
    struct {
        unsigned                        :5;
        unsigned GRD1POL                :1;
        unsigned GRD1AOE                :1;
        unsigned GRD1BOE                :1;
    };
    struct {
        unsigned                        :5;
        unsigned GRDPOL                 :1;
        unsigned GRDAOE                 :1;
        unsigned GRDBOE                 :1;
    };
} AAD1GRDbits_t;
extern volatile AAD1GRDbits_t AAD1GRDbits __at(0x718);
// bitfield macros
#define _AAD1GRD_GRD1POL_POSN                               0x5
#define _AAD1GRD_GRD1POL_POSITION                           0x5
#define _AAD1GRD_GRD1POL_SIZE                               0x1
#define _AAD1GRD_GRD1POL_LENGTH                             0x1
#define _AAD1GRD_GRD1POL_MASK                               0x20
#define _AAD1GRD_GRD1AOE_POSN                               0x6
#define _AAD1GRD_GRD1AOE_POSITION                           0x6
#define _AAD1GRD_GRD1AOE_SIZE                               0x1
#define _AAD1GRD_GRD1AOE_LENGTH                             0x1
#define _AAD1GRD_GRD1AOE_MASK                               0x40
#define _AAD1GRD_GRD1BOE_POSN                               0x7
#define _AAD1GRD_GRD1BOE_POSITION                           0x7
#define _AAD1GRD_GRD1BOE_SIZE                               0x1
#define _AAD1GRD_GRD1BOE_LENGTH                             0x1
#define _AAD1GRD_GRD1BOE_MASK                               0x80
#define _AAD1GRD_GRDPOL_POSN                                0x5
#define _AAD1GRD_GRDPOL_POSITION                            0x5
#define _AAD1GRD_GRDPOL_SIZE                                0x1
#define _AAD1GRD_GRDPOL_LENGTH                              0x1
#define _AAD1GRD_GRDPOL_MASK                                0x20
#define _AAD1GRD_GRDAOE_POSN                                0x6
#define _AAD1GRD_GRDAOE_POSITION                            0x6
#define _AAD1GRD_GRDAOE_SIZE                                0x1
#define _AAD1GRD_GRDAOE_LENGTH                              0x1
#define _AAD1GRD_GRDAOE_MASK                                0x40
#define _AAD1GRD_GRDBOE_POSN                                0x7
#define _AAD1GRD_GRDBOE_POSITION                            0x7
#define _AAD1GRD_GRDBOE_SIZE                                0x1
#define _AAD1GRD_GRDBOE_LENGTH                              0x1
#define _AAD1GRD_GRDBOE_MASK                                0x80

// Register: AD1CAPCON
#define AD1CAPCON AD1CAPCON
extern volatile unsigned char           AD1CAPCON           __at(0x719);
#ifndef _LIB_BUILD
asm("AD1CAPCON equ 0719h");
#endif
// aliases
extern volatile unsigned char           AADCAP              __at(0x719);
#ifndef _LIB_BUILD
asm("AADCAP equ 0719h");
#endif
extern volatile unsigned char           AAD1CAP             __at(0x719);
#ifndef _LIB_BUILD
asm("AAD1CAP equ 0719h");
#endif
extern volatile unsigned char           AAD1CAPCON          __at(0x719);
#ifndef _LIB_BUILD
asm("AAD1CAPCON equ 0719h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD1CAP                :4;
    };
} AD1CAPCONbits_t;
